doc_backup/code_style/code_style.tex
% Created 2017-12-29 vie 15:38
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Julio}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Julio},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 24.5.1 (Org mode 9.0.9)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

Here we present a kind of coding/programming style policies to happily
coding together. First of all, as you may already noticed, we use
\textbf{C++} as our programming language. Why? well, that is because of its
widely continuous spreading along the scientific community and all its
nicely offered features.

The list of rules that you will find here are taken from our own
experience. We took what has worked for us when working in cooperative
projects, and set aside those silly things that only made cooperation
painful and no longer fun. We encourage you to talk with us about new
and excitement cooperation ideas you know. Hope you agree with us in
what we present here. Sit back, relax and happy reading.

\section{Coding style}
\label{sec:org15c0b73}

\subsection{Comments}
\label{sec:org742c172}

\emph{"Comments are supposed to make your code easier to understand and
maintain-- not harder"}, \href{http://blog.codinghorror.com/when-good-comments-go-bad}{when comments go bad}.

There is nothing more frustrating than having to review someone's else
code (and sometimes our own code) and find out that the variables or
functions names are not representative of what they are used for. The
code is a complete mess, it has no identation at all, and the worse
thing is that there is not a single commented line to give us a clue
of what is going on. In this case we have two options,
\begin{itemize}
\item spend our whole day (or even more) to understand the code (and find
out that the code is not doing what you are looking for), or
\item throw it away and do your own implementation (I personally prefer
this option).
\end{itemize}

Certainly, the above prevents code reusing which is one of the main
purposes of this library.

First of all, \sout{try to} make your code as \textbf{self-explanatory} as
possible. Suppose that you are telling a story to a group of people
and you want everyone that is hearing you do not get lost while you
are talking. If the syntaxis of the programming language does not
allow you to write your story clearly then use comments, do not be
afraid of using them.

Put your \textbf{comments as close as possible to the source code they are
referring}. A developer may not notice a comment that referrs to a
code line that he/she is modifying, thus the comments and the code
will be out of sync, \href{http://blog.codinghorror.com/when-good-comments-go-bad}{when commnets go bad}.

Use \textbf{comments to clarify the selection of some algorithms} or to
mention things to remember during the execution of the code.

When writing \textbf{functions} that perform a large number of sub-tasks, use
the initial part of it to write a (brief!) \textbf{summary of the followed
strategy by the function} and include a list with the main steps of
the function. This helps the reader of your code to get an idea of
what to expect in the body of the function.

One final thing, always keep in mind that what may be transparently
obvious for you, may be completely obscure and complex to another
developer (or for yourself after returning from a non-programming
period), \textbf{use comments to ease the reading of your code, not to make
it harder.}

If you are looking for some good reasons for not documenting your code
then check these ones \href{http://everything2.com/index.pl?node\_id=1709851\&displaytype=printable}{(why programmers do not comment their code)} and
see what better matches with you.

\subsection{Indentation}
\label{sec:orgba77122}
This is simple, \textbf{indent your code for easy reading}. I use emacs as my
preferred editor and have it configured to automatically \textbf{indent with
a single white-space} when pressing TAB. You can copy and use my emacs
configuration file (init.el) from the \textbf{\emph{tools}} folder, or configure
your favorite editor to \textbf{indent with a single white-space}.

\subsection{Variables}
\label{sec:orgb85970c}
We use variables to store values or data that are used frequently in
the body of a function or as part of a class.

\subsubsection{Variables names}
\label{sec:orgc2b224c}
Use \textbf{variable names that reflect the values or data stored in the
variable}. If you require to store the velocity you may use \texttt{v} or
\texttt{velocity} as the variable name.

Avoid using the well known variables names:

\begin{table}[htbp]
\caption{\label{tab:org91207eb}
Bad variables names}
\centering
\begin{tabular}{lll}
\texttt{var1} & \texttt{var2} & \texttt{var3}\\
\texttt{value} & \texttt{variable} & \texttt{my\_variable}\\
\texttt{this\_variable} & \texttt{other\_variable} & \texttt{another\_variable}\\
\texttt{delete\_variable} & \texttt{here} & \texttt{there}\\
\end{tabular}
\end{table}

I know you (use?) have used those variable names, everyone does it.

Variables that stores the number of elements of something must use the
prefix \{\verb n\_ \}. For example, if you want to store the number of
processors, the variable must be named as follow:

\begin{lstlisting}[language=C++]
  const unsigned n_processors = nprocessors();
\end{lstlisting}

\subsection{Variables types}
Use \texttt{unsigned} instead of \texttt{int} in loops (\texttt{for}
or \texttt{while}) that do not require negative indexes.

\subsection\{\texttt{Const} or variable?\}
Well, it happens that in C++, variables that do not pretend to change
their value along the entire exection of the program are declared with
a \texttt{const} before the variable type. They why are they still
called variables, well you may be interested to read this.

Anyway, use \texttt{const} on variables that are not intented to
change their value. Remember that when using \texttt{const} you need
to specify the value of the variable at the time of its declaration.

\section{Functions}
Functions are a great idea that let us split a complicated tasks in
small (or not that small) and easy to digest sub-tasks. We can
implement a complex task as a set of subtasks, each implementing a
basic idea that may be re-used in other complex tasks.

Think of a function as an independent task that may even call other
functions to perform its job. A funtion

\subsection{Functions types}

\subsection{Functions names}
When working in small-individual project it is quite tempting to use
short name functions, first because no one else will use (or review)
our code, and second because of laziness. We pretend that this library
be (re-)used by a large community, thus function's names that reflect
the intention or work performed by the function is a good way to
promote reusability.

\begin{itemize}
  \item Functions names MUST all be in lowercase.
  \item Use ``\_'' to separate words in the function name.
\end{itemize}

\subsection{Split large funtions into sub-task}

\subsection{Input and output arguments}

\subsubsection{Const or non const}
Use ``const'' as much as you can, if you do not need (or do not know)
to change the value of a variable inside a function then use ``const''
before the type of the variable\\

\texttt{const unsigned no\_modified\_variabled} (why is it called a
variable then?)

otherwise do not use ``const'' \texttt{unsigned modified\_variable}.


\subsubsection{Pass by copy or pass by reference}
Only pass arguments by copy when they are a single value, such as an
integer or a double value. Any other argument MUST be passed by
reference. This is to avoid copying large vectors, matrices or objects
and thus run out of memory because of the many copies of the same
object in memory. If we do not really need a copy of every single
element in a vector, matrix or object then why should we make a copy
ot it?

Examples of passing arguments by reference here soon

Use $\backslash$& when passing an argument by reference

DELETE DELETE
\end{document}